NikolayBobovnikov/ircapture/auvir_embed/mocap/transmitter/stm32f100/Src/main.c
            // Start sequence consists of signal sequence {1,0,1}
            switch(StartStopSequenceTransmitState)
            {
                case STAGE_0:
                {
                    StartStopSequenceTransmitState = STAGE_ON1;
                    force_envelop_timer_output_on();
                    break;
                }
                case STAGE_ON1:
                {
                    StartStopSequenceTransmitState = STAGE_OFF1;
                    force_envelop_timer_output_off();
                    break;
                }
                case STAGE_OFF1:
                {
                    StartStopSequenceTransmitState = STAGE_ON2;
                    force_envelop_timer_output_on();
                    break;
                }

                // transitional state
                // TODO: check if possible to move to beginning of next state (thus remove delay)
                case STAGE_ON2:
                {
                    phtim_envelop->Instance->ARR = DelayBetweenDataFramesTotal;
                    StartStopSequenceTransmitState = STAGE_0;
                    TransmitterState = TX_DELAY;
                    break;
                }
            }
            break;
        }
        case TX_DELAY:
        {
            reset_transmitter();
            break;
        }
    } // switch(TransmitterState)
}
void reset_transmitter()
{
    TransmitterState = TX_WAITING;
    // TODO: add other steps if needed
    phtim_envelop->Instance->ARR = StartStopBitLength;
    StartStopSequenceTransmitState = STAGE_0;
    DataFrameState = DATAFRAME_0_NODATA;
}

void switch_to_data_transmission_state()
{
    TransmitterState = TX_DATA;
    DataFrameState = DATAFRAME_1_BEAMER_ID;
    StartStopSequenceTransmitState = STAGE_0;
    tx_current_bit_pos = 0;
    force_envelop_timer_output_off();
}

void p_w_modulate(uint8_t bit)
{
    if(bit == 1)
    {
        force_envelop_timer_output_on();
    }
    else // bit == 0
    {
        force_envelop_timer_output_off();
    }

}

void force_envelop_timer_output_on()
{
#ifdef DEBUG
    HAL_GPIO_WritePin(GPIOB, GPIO_PIN_4 | GPIO_PIN_5, GPIO_PIN_SET);
#endif
    // Start pwm timer, depending on timer and channel number
    switch(currentOutputTimChannel)
    {
        case Timer2Channel1:
        {
            HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_1); // carrier
            break;
        }
        case Timer2Channel2:
        {
            HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_2); // carrier
            break;
        }
        case Timer2Channel3:
        {
            HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_3); // carrier
            break;
        }
        case Timer2Channel4:
        {
            HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_4); // carrier
            break;
        }
        case Timer3Channel1:
        {
            HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_1); // carrier
            break;
        }
        case Timer3Channel2:
        {
            HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_2); // carrier
            break;
        }
        case Timer3Channel3:
        {
            HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_3); // carrier
            break;
        }
        case Timer3Channel4:
        {
            HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_4); // carrier
            break;
        }
        case Timer4Channel1:
        {
            HAL_TIM_PWM_Start(&htim4, TIM_CHANNEL_1); // carrier
            break;
        }
        case Timer4Channel2:
        {
            HAL_TIM_PWM_Start(&htim4, TIM_CHANNEL_2); // carrier
            break;
        }
        case Timer4Channel3:
        {
            HAL_TIM_PWM_Start(&htim4, TIM_CHANNEL_3); // carrier
            break;
        }
        case Timer4Channel4:
        {
            HAL_TIM_PWM_Start(&htim4, TIM_CHANNEL_4); // carrier
            break;
        }
    }


}

void force_envelop_timer_output_off()
{
/*
        HAL_TIM_PWM_Stop(&htim2, TIM_CHANNEL_1); // carrier
        HAL_TIM_PWM_Stop(&htim2, TIM_CHANNEL_2); // carrier
        HAL_TIM_PWM_Stop(&htim2, TIM_CHANNEL_3); // carrier
        HAL_TIM_PWM_Stop(&htim2, TIM_CHANNEL_4); // carrier
        HAL_TIM_PWM_Stop(&htim4, TIM_CHANNEL_1); // carrier
        HAL_TIM_PWM_Stop(&htim4, TIM_CHANNEL_2); // carrier
        HAL_TIM_PWM_Stop(&htim4, TIM_CHANNEL_3); // carrier
        HAL_TIM_PWM_Stop(&htim4, TIM_CHANNEL_4); // carrier
        */
#ifdef DEBUG
    HAL_GPIO_WritePin(GPIOB, GPIO_PIN_4 | GPIO_PIN_5, GPIO_PIN_RESET);
#endif
    // Stopt pwm timer, depending on timer and channel number
    switch(currentOutputTimChannel)
    {
        case Timer2Channel1:
        {
            HAL_TIM_PWM_Stop(&htim2, TIM_CHANNEL_1); // carrier
            break;
        }
        case Timer2Channel2:
        {
            HAL_TIM_PWM_Stop(&htim2, TIM_CHANNEL_2); // carrier
            break;
        }
        case Timer2Channel3:
        {
            HAL_TIM_PWM_Stop(&htim2, TIM_CHANNEL_3); // carrier
            break;
        }
        case Timer2Channel4:
        {
            HAL_TIM_PWM_Stop(&htim2, TIM_CHANNEL_4); // carrier
            break;
        }
        case Timer3Channel1:
        {
            HAL_TIM_PWM_Stop(&htim3, TIM_CHANNEL_1); // carrier
            break;
        }
        case Timer3Channel2:
        {
            HAL_TIM_PWM_Stop(&htim3, TIM_CHANNEL_2); // carrier
            break;
        }
        case Timer3Channel3:
        {
            HAL_TIM_PWM_Stop(&htim3, TIM_CHANNEL_3); // carrier
            break;
        }
        case Timer3Channel4:
        {
            HAL_TIM_PWM_Stop(&htim3, TIM_CHANNEL_4); // carrier
            break;
        }
        case Timer4Channel1:
        {
            HAL_TIM_PWM_Stop(&htim4, TIM_CHANNEL_1); // carrier
            break;
        }
        case Timer4Channel2:
        {
            HAL_TIM_PWM_Stop(&htim4, TIM_CHANNEL_2); // carrier
            break;
        }
        case Timer4Channel3:
        {
            HAL_TIM_PWM_Stop(&htim4, TIM_CHANNEL_3); // carrier
            break;
        }
        case Timer4Channel4:
        {
            HAL_TIM_PWM_Stop(&htim4, TIM_CHANNEL_4); // carrier
            break;
        }
    }
}
/* USER CODE END 4 */

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
